
// for ციკლები იყოფა სამ ნაწილად
// 1-ელ ნაწილში მოცემულია საწყისი მნიშნველობა მაგ. count=1-ნიშნავს, რომ დაიწყოს იტერაცია(დატრიალება) 1-დან
// მე-2 ნაწილში მოცემულია ის პირობა რამაც უნდა გამოიწვიოს ამ for ციკლის შეჩერება, ანუ მისი საბოლოო წერტილი, ჩვენს შემთხვევაში ეს გახლავთ ის მდგომარეობა, როდესაც count იტერატორის მნიშვნელობამ გადააჭარბა (რადგანაც მაქსიმუმ იგი შეიძლება იყოს 10-ის ტოლი) 10-ს.
// მე-3 ნაწილში მოცემულია ის, თუ რა უნდა მოიმოქმედოს for ციკლმა თითოეულ დატრიალებაზე, ჩვენს მაგალითში ეს გახლავთ, count-იტერატორის 1-ით გაზრდა ყოველ ჯერზე.

for (let count = 1; count <= 10; count = count + 1) {
    // % წარმოადგენს საშუალებას, რომ გავიგოთ, კონკრეტული გამყოფი გაყოფილი გასაყოფზე იძლევა თუ არა ნაშთში 0-ს. 
    if (count % 2 === 0) {
        console.log(`following number is even ${count}`);
    } else {
        console.log(`following number are odd ${count}`);
    }
}