let litersToPour = 10;

let count = 0;

// while ციკლი შედგება საკუთარი პირობისაგან, რომელიც ფრჩხილებშია მოცემული (count < litersToPour), იგი უნდა იქნეს მიღწეული კონკრეტული იტერაციების შემდგომ
// თუ ეს ასე არ მოხდა, ეს გამოიწვევს ე.გ "ჩაციკვლას" რაც ნიშნავს იმას, რომ ეს ციკლური ოპერაცია არასდროს არ დასერულდება
// ესეთ დროს, რომ არ მოხდეს საკუთარი მოწყობილობის გადატივრთვა "გაჭედვა" კონკრეტულ პროგრამირების ენებს აქვთ განსაზღვრული ლიმიტები, რომლმებსაც ჩაციკლული ოპერაცია ვერ აცდება
// ესეთ დროს თუ ლიმიტს მიაღწია, ხდება მისი ძალით გათიშვა.

while (count < litersToPour) { 
    count = count + 1
    console.log(`Total amount of water in bank: ${count}`);
}

console.log('Water bank is full!');

// გამოგვაქვს 1-დან 10-მდე ლუწი რიცხვები ეკრანზე
count = 0;
while (count < 10) {
    count = count +1;
    // % წარმოადგენს საშუალებას, რომ გავიგოთ, კონკრეტული გამყოფი გაყოფილი გასაყოფზე იძლევა თუ არა ნაშთში 0-ს. 
    if (count % 2 === 0) {
        console.log(`following number is even ${count}`);
    } else {
        console.log(`following number are odd ${count}`);
    }
}