let num1 = "10.5";
let num2 = "20";

// alert(Number(num1) + Number(num2)); // Number()-ს გადაყავს სტრიქონულ ფორმატში არსებული რიცხვი რიცხვით ფორმატში.

let num3 = "!10.7aa";
// alert(parseInt(num3)); // სტრიქონული ტიპის რიცხვი გადაყავს მთელ ტიპა რიცხვში.

let num4 = "15.99";
alert(parseFloat(num4)); //  სტრიქონული ტიპის რიცხვი გადაყავს წილადურ ტიპა რიცხვში.

alert(Math.floor('20.35')); // ამრგვალებს უახლოეს მთელ ტიპა რიცხვამდე.

let num5 = 58;

// alert(typeof String(num5)); // აკონვერტირებს მონაცემებს სტრიქონული ტიპის მონაცემებად.
// alert(typeof num5.toString()); // აკონვერტირებს მონაცემებს სტრიქონული ტიპის მონაცემებად.